testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_10000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/6/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 363.25ms, 27.53 req/s, 262.62MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 95.40MB (100031270) total, 120B (120) headers (space savings 87.37%), 95.37MB (100000000) data
UDP datagram: 2745 sent, 82164 received
                     min         max         mean         sd        +/- sd
time for request:   305.09ms    354.68ms    327.06ms     18.66ms    60.00%
time for connect:     4.13ms     25.67ms     14.76ms      7.33ms    60.00%
time to 1st byte:    25.47ms     27.97ms     26.71ms      1.03ms    50.00%
req/s           :       2.76        3.08        2.93        0.13    50.00%